<template>
  <q-page  class="bg-[#778DA9]">
    <div class="q-pa-md">
      <div class="my-5 text-lg text-[#FFFFFF] font-black">ประวัติการสั่งซื้อ</div>
    <q-table
      :rows="rows"
      row-key="name"
      class="w-full"
    />
  </div>
  </q-page>
</template>

<script>
import { defineComponent, ref } from "vue";

const rows = [
  {
    เลขใบสั่งซื้อ: 'Frozen Yogurt',
    เกม: 159,
    แพ็คเก็จ: 6.0,
    ไอดีเกม: 24,
    วันสั่งซื้อ: 4.0,
    ราคา: 87,
    สถานะ: '14%',

  },
  {
    เลขใบสั่งซื้อ: 'Frozen Yogurt',
    เกม: 159,
    แพ็คเก็จ: 6.0,
    ไอดีเกม: 24,
    วันสั่งซื้อ: 4.0,
    ราคา: 87,
    สถานะ: '14%',
  },
  {
    เลขใบสั่งซื้อ: 'Arozen Yogurt',
    เกม: 159,
    แพ็คเก็จ: 6.0,
    ไอดีเกม: 24,
    วันสั่งซื้อ: 4.0,
    ราคา: 87,
    สถานะ: '14%',
  },
  {
   เลขใบสั่งซื้อ: 'Frozen Yogurt',
    เกม: 159,
    แพ็คเก็จ: 6.0,
    ไอดีเกม: 24,
    วันสั่งซื้อ: 4.0,
    ราคา: 87,
    สถานะ: '14%',
  },
  {
    เลขใบสั่งซื้อ: 'Frozen Yogurt',
    เกม: 159,
    แพ็คเก็จ: 6.0,
    ไอดีเกม: 24,
    วันสั่งซื้อ: 4.0,
    ราคา: 87,
    สถานะ: '14%',
  },
  {
   เลขใบสั่งซื้อ: 'Frozen Yogurt',
    เกม: 159,
    แพ็คเก็จ: 6.0,
    ไอดีเกม: 24,
    วันสั่งซื้อ: 4.0,
    ราคา: 87,
    สถานะ: '14%',
  },
  {
   เลขใบสั่งซื้อ: 'Frozen Yogurt',
    เกม: 159,
    แพ็คเก็จ: 6.0,
    ไอดีเกม: 24,
    วันสั่งซื้อ: 4.0,
    ราคา: 87,
    สถานะ: '14%',
  },
  {
   เลขใบสั่งซื้อ: 'Frozen Yogurt',
    เกม: 159,
    แพ็คเก็จ: 6.0,
    ไอดีเกม: 24,
    วันสั่งซื้อ: 4.0,
    ราคา: 87,
    สถานะ: '14%',
  },
  {
    เลขใบสั่งซื้อ: 'Frozen Yogurt',
    เกม: 159,
    แพ็คเก็จ: 6.0,
    ไอดีเกม: 24,
    วันสั่งซื้อ: 4.0,
    ราคา: 87,
    สถานะ: '14%',
  },
  {
    เลขใบสั่งซื้อ: 'Frozen Yogurt',
    เกม: 159,
    แพ็คเก็จ: 6.0,
    ไอดีเกม: 24,
    วันสั่งซื้อ: 4.0,
    ราคา: 87,
    สถานะ: '14%',
  }
]
export default defineComponent({
        setup(){
            return { rows }

        }
})
</script>

<style>

</style>